Revit 2024 API
BuiltInFailures.EditingFailures.CannotEditElements Property
 Workset is editable, but you can't edit the element until '[Borrowers]' resaves the element to central and relinquishes it and you Reload Latest.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotEditElements { get; }
Visual Basic
Public Shared ReadOnly Property CannotEditElements As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotEditElements {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace